job/JMeter_Jenkins_Grafana/test-plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
    <hashTree>
        <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
            testname="AC - Teste de Carga JMeter + Grafana" enabled="true">
            <stringProp name="TestPlan.comments">Plano de carga simples cujos resultados sao
                enviados ao InfluxDB e visualizados no Grafana.</stringProp>
            <boolProp name="TestPlan.functional_mode">false</boolProp>
            <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
            <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"
                guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables"
                enabled="true">
                <collectionProp name="Arguments.arguments">
                    <elementProp name="HOST" elementType="Argument">
                        <stringProp name="Argument.name">HOST</stringProp>
                        <stringProp name="Argument.value">${__P(host,blazedemo.com)}</stringProp>
                        <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                    <elementProp name="THREADS" elementType="Argument">
                        <stringProp name="Argument.name">THREADS</stringProp>
                        <stringProp name="Argument.value">${__P(threads,10)}</stringProp>
                        <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                    <elementProp name="RAMP" elementType="Argument">
                        <stringProp name="Argument.name">RAMP</stringProp>
                        <stringProp name="Argument.value">${__P(ramp,5)}</stringProp>
                        <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                    <elementProp name="DURATION" elementType="Argument">
                        <stringProp name="Argument.name">DURATION</stringProp>
                        <stringProp name="Argument.value">${__P(duration,60)}</stringProp>
                        <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                    <elementProp name="INFLUX_URL" elementType="Argument">
                        <stringProp name="Argument.name">INFLUX_URL</stringProp>
                        <stringProp name="Argument.value">${__P(influxUrl,http://influxdb:8086/write?db=jmeter)}</stringProp>
                        <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                </collectionProp>
            </elementProp>
        </TestPlan>
        <hashTree>
            <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                testname="Usuarios Virtuais" enabled="true">
                <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
                <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                    guiclass="LoopControlPanel" testclass="LoopController"
                    testname="Loop Controller" enabled="true">
                    <boolProp name="LoopController.continue_forever">false</boolProp>
                    <intProp name="LoopController.loops">-1</intProp>
                </elementProp>
                <stringProp name="ThreadGroup.num_threads">${THREADS}</stringProp>
                <stringProp name="ThreadGroup.ramp_time">${RAMP}</stringProp>
                <boolProp name="ThreadGroup.scheduler">true</boolProp>
                <stringProp name="ThreadGroup.duration">${DURATION}</stringProp>
                <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
            </ThreadGroup>
            <hashTree>
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="GET Home" enabled="true">
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                        guiclass="HTTPArgumentsPanel" testclass="Arguments"
                        testname="User Defined Variables" enabled="true">
                        <collectionProp name="Arguments.arguments" />
                    </elementProp>
                    <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <stringProp name="HTTPSampler.path">/</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
                    <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
                </HTTPSamplerProxy>
                <hashTree>
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Status 200" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="49586">200</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                        <boolProp name="Assertion.assume_success">false</boolProp>
                        <intProp name="Assertion.test_type">8</intProp>
                    </ResponseAssertion>
                    <hashTree />
                </hashTree>
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="GET Reserve" enabled="true">
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                        guiclass="HTTPArgumentsPanel" testclass="Arguments"
                        testname="User Defined Variables" enabled="true">
                        <collectionProp name="Arguments.arguments" />
                    </elementProp>
                    <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <stringProp name="HTTPSampler.path">/reserve.php</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
                    <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
                </HTTPSamplerProxy>
                <hashTree />
                <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer"
                    testname="Throughput Timer" enabled="true">
                    <intProp name="calcMode">2</intProp>
                    <doubleProp>
                        <name>throughput</name>
                        <value>600.0</value>
                        <savedValue>0.0</savedValue>
                    </doubleProp>
                </ConstantThroughputTimer>
                <hashTree />
                <BackendListener guiclass="BackendListenerGui" testclass="BackendListener"
                    testname="InfluxDB Backend Listener" enabled="true">
                    <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel"
                        testclass="Arguments" testname="User Defined Variables" enabled="true">
                        <collectionProp name="Arguments.arguments">
                            <elementProp name="influxdbMetricsSender" elementType="Argument">
                                <stringProp name="Argument.name">influxdbMetricsSender</stringProp>
                                <stringProp name="Argument.value">org.apache.jmeter.visualizers.backend.influxdb.HttpMetricsSender</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                            <elementProp name="influxdbUrl" elementType="Argument">
                                <stringProp name="Argument.name">influxdbUrl</stringProp>
                                <stringProp name="Argument.value">${INFLUX_URL}</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                            <elementProp name="application" elementType="Argument">
                                <stringProp name="Argument.name">application</stringProp>
                                <stringProp name="Argument.value">ac-jmeter</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                            <elementProp name="measurement" elementType="Argument">
                                <stringProp name="Argument.name">measurement</stringProp>
                                <stringProp name="Argument.value">jmeter</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                            <elementProp name="summaryOnly" elementType="Argument">
                                <stringProp name="Argument.name">summaryOnly</stringProp>
                                <stringProp name="Argument.value">false</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                            <elementProp name="samplersRegex" elementType="Argument">
                                <stringProp name="Argument.name">samplersRegex</stringProp>
                                <stringProp name="Argument.value">.*</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                            <elementProp name="percentiles" elementType="Argument">
                                <stringProp name="Argument.name">percentiles</stringProp>
                                <stringProp name="Argument.value">90;95;99</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                            <elementProp name="testTitle" elementType="Argument">
                                <stringProp name="Argument.name">testTitle</stringProp>
                                <stringProp name="Argument.value">AC Teste de Carga</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                            <elementProp name="eventTags" elementType="Argument">
                                <stringProp name="Argument.name">eventTags</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                        </collectionProp>
                    </elementProp>
                    <stringProp name="classname">org.apache.jmeter.visualizers.backend.influxdb.InfluxdbBackendListenerClient</stringProp>
                </BackendListener>
                <hashTree />
            </hashTree>
        </hashTree>
    </hashTree>
</jmeterTestPlan>